{
    "about": {
        "skills": {
            "concepts": ["Software Development", "Data Structures", "Algorithms", "Distributed Systems", "Scalable Solutions", "Microservices", "Functional Programming", "Unit Testing", "System Design", "Databasing", "Version Control", "APIs", "Containerization", "Test Automation", "CI/CD", "DevOps", "IaC", "Object-Oriented Programming"],
            "technologies": ["Java", "Python", "Git", "SQL", "Linux", "Mockito", "Docker", "React.js", "AWS", "C++", "JSON", "YAML", "HTML", "CSS"]
        },
        "experience": [
            {
                "entity": "Amazon Web Services",
                "title": "Systems Development Engineer",
                "start": "02/2022",
                "end": "10/2023",
                "details": [
                    "Enabled the launch of 21 discrete data centres serving external customers in 7 distinct geographical locations within the span of 2 years, as well as the automatic migration of thousands of AWS cloud services across hundreds of existing data centres, driving overall company growth",
                    "Ensured reliable, available, and user-friendly development tools for thousands of internal customers, empowering them to drive sales via routine end-to-end testing, monitoring, and maintenance of SaaS offerings for continuous functionality and high performance",
                    "Drove efficiency via facilitation of Agile methodology by leading and participating in regular scrum, design, informational, process improvement, and planning meetings, which enabled my team to complete tasks in 8 days or less",
                    "Upheld high performance and reliability of SaaS offerings by resolving 1-5 technical issues daily, which minimized costs by increasing software stability",
                    "Increased service adoption for my team by approx. 3 customers per week by troubleshooting user issues, and researching and answering user questions in our forum in a timely fashion",
                    "Improved operations by analyzing workflows, identifying and addressing gaps in existing processes as well as designing new ones, and continuously iterating on solutions",
                    "Exceptional oral and written communication skills, and professional experience as a business/engineering leader responsible for communicating information to technical and non-technical internal and external clients"
                ]
            },
            {
                "entity": "Ulteig",
                "title": "System Integrator",
                "start": "06/2021",
                "end": "02/2022",
                "details": [
                    "Developed PLC logic for Allen-Bradley MicroLogix processors automating control of sensors and actuators used in water and wastewater treatment processes across various cities.",
                    "Designed and programmed HMI screens facilitating simplistic and efficient local and remote monitoring and control of automated systems.",
                    "Generated and updated documentation of treatment systems to clearly communicate their design and function."
                ]
            },
            {
                "entity": "Mixto",
                "title": "Client Accounts Coordinator",
                "start": "03/2021",
                "end": "05/2021",
                "details": [
                    "Coordinated internal operations at multiple levels to consistently deliver high quality service for our clientele within 3 business days",
                    "Lead meetings with clients for large scale, long term, high sensitivity projects ensuring that requirements and expectations were communicated clearly between internal and external stakeholders",
                    "Trained new employees and developed a manual of tasks and best practices for success"
                ]
            },
            {
                "entity": "Halton Region",
                "title": "SCADA Technology Co-op Student",
                "start": "01/2019",
                "end": "08/2019",
                "details": [
                    "Developed a VB application for secure monitoring, collection, and historizing of hundreds of thousands of unique data points used in water and wastewater treatment process control and auditing across the region",
                    "Performed firmware updates, device configuration, and programming on Allen-Bradley ControlLogix. MicroLogix, SLCs, and Power Monitors used in water and wastewater treatment processes across the region",
                    "Generated electrical schematics, network drawings, design drawings, and P&IDs for new device installations using AutoCAD",
                    "Reviewed and updated network architecture drawings in AutoCAD which were used for keeping track of devices on the WAN and improving efficiency in the process of remotely accessing and controlling those devices"
                ]
            }
        ],
        "education": [
            {
                "entity": "McMaster University",
                "title": "Bachelor of Technology, Automation Engineering Technology Co-op",
                "start": "09/2016",
                "end": "06/2021",
                "details": "A multidisciplinary program at the intersection of chemical, mechanical, electrical, and computer engineering."
            },
            {
                "entity": "Mohawk College",
                "title": "Advanced Diploma in Chemical Engineering Technology - Process Automation",
                "start": "09/2016",
                "end": "06/2021",
                "details": "A component of the B.Tech degree focused on chemical engineering in the context of industrial manufacturing."
            },
            {
                "entity": "Mohawk College",
                "title": "Certificate in Business",
                "start": "09/2016",
                "end": "06/2021",
                "details": "An ACBSP accredited business degree awarded upon completion of the B.Tech program."
            }
        ]
    },
    "blog": [
        {
            "number": 1,
            "name": "Portfolio Website",
            "shortDesc": "This website was built by me from scratch using React.js and CSS as well as a bit of JSON. Click here to read more about it!",
            "longDesc": "",
            "path": "/blog#portfolio-website",
            "doc": "https://docs.google.com/document/d/1dkMhavEo6vvuaJclAmEFLJl_hYpnJ_7YlzYwBzZhiGg/edit#heading=h.4pujimuihw23"
        }
    ],
    "demo": [
        {
            "number": 2,
            "name": "Simple EQ Plugin",
            "preview": "",
            "prevAlt": "",
            "shortDesc": "Demo coming soon!",
            "path": "/demo/simple-eq-plugin"
        }
    ],
    "projects": [
        {
            "number": 1,
            "name": "Portfolio Website",
            "preview": "",
            "prevAlt": "",
            "status": "IN PROGRESS",
            "repo": "https://github.com/JavaughnS/portfolio-website",
            "shortDesc": "Learn more about this website and the methods and technologies I used to build it.",
            "longDesc": "",
            "path": "/projects#portfolio-website",
            "doc": ""
        },
        {
            "number": 2,
            "name": "Simple EQ Plugin",
            "preview": "",
            "prevAlt": "",
            "status": "IN PROGRESS",
            "repo": "https://github.com/JavaughnS/SimpleEQPlugin",
            "shortDesc": "An integral part of audio engineering is being able to target and manipulate specific frequency bands comprising a sound. This Simple EQ plugin is a tool for performing that manipulation.",
            "longDesc": "",
            "path": "/projects#simple-eq-plugin",
            "doc": ""
        }
    ]
}